a = input("Здравсвуйте, как я могу к вам обращатся? ")
b = input(f"Приятно познакомится {a}, какую машину вы ищите? ")
c = input(f"{b}, неплохой выбор, какой ваш бюджет? ")
print(f"Подберем что то на {c}\n")


e = input("Здравствуйте, столик на сколько человек забронировать вам? ")
f = input("Какие блюда вы будете заказывать и на какое время вы будете? ")
print(f"Ждем на {f}, досвидание!")

x = "Pyt"
y = "hon"
print(x + y)


import random
g=[26, 74, 85, 12, 1, 20]
print (random.choice(g))
